posts/project-alpaca/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="About project ALPaCa.">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Project ALPaCa | Packet Capture</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://github.com/necromuralist/packet_capture/posts/project-alpaca/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="necromuralist">
<link rel="prev" href="../packet-capturing-bibliography/" title="Packet Capturing Bibliography" type="text/html">
<link rel="next" href="../pcap-types-and-sub-types/" title="PCAP Types and Sub-Types" type="text/html">
<meta property="og:site_name" content="Packet Capture">
<meta property="og:title" content="Project ALPaCa">
<meta property="og:url" content="https://github.com/necromuralist/packet_capture/posts/project-alpaca/">
<meta property="og:description" content="About project ALPaCa.">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-06-10T14:47:23-07:00">
<meta property="article:tag" content="alpaca">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-default navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://github.com/necromuralist/packet_capture/">

                <span id="blog-title">Packet Capture</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../">Notes</a>
                </li>
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../../categories/">Tags</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Project ALPaCa</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    necromuralist
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2018-06-10T14:47:23-07:00" itemprop="datePublished" title="2018-06-10 14:47">2018-06-10 14:47</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org00bc2a6" class="outline-2">
<h2 id="org00bc2a6">What's this about, then?</h2>
<div class="outline-text-2" id="text-org00bc2a6">
<p>
An <a href="https://en.wikipedia.org/wiki/Alpaca">Alpaca</a> is a South American animal that is similar to a llama. Project ALPaCa is A Little Packet Capturer project that I'm creating to hopefully make packet capturing easier for me. One of the problems with something as complicated as packet capture and packet analysis is that there is no real easy first step. Right from the start you have to try and learn a whole bunch of things, read a lot of (probably poorly written) documentation and at the same time try it all out. I intend for Project ALPaCa to abstract the capturing and gathering of packets so that I'll have something that both does the capturing and acts as a static document about how to do it so I don't have to rely on my <code>.history</code> file (or worse, my memory).
</p>
</div>
</div>
<div id="outline-container-org83de33d" class="outline-2">
<h2 id="org83de33d">Okay, but… what?</h2>
<div class="outline-text-2" id="text-org83de33d">
<p>
I'm primarily trying to learn more about wireless packet capturing and analysis. There's a lot of different programs and hardware out there, most of which claims that they have the solution - or at least a better solution- than the others, but I'm fundamentally not a technologist. I want to learn the concepts more than I want to learn some specific program. So I'm going to try and put into code the things that I learn so that I don't have to really learn them, and maybe write up what I find as well. Though this is <i>Project ALPaCa</i>, this notebook is more my <i>Adventures In Packet Capturing</i>, but I couldn't find a good acronym based on AIPC.
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/alpaca/" rel="tag">alpaca</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../packet-capturing-bibliography/" rel="prev" title="Packet Capturing Bibliography">Previous post</a>
            </li>
            <li class="next">
                <a href="../pcap-types-and-sub-types/" rel="next" title="PCAP Types and Sub-Types">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2018         <a href="mailto:necromuralist@protonmail.com">necromuralist</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
